app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "remember_token", "email") VALUES('nirmal', '494ab503fcb6cd5dfe951c1c70cf2b8a954d9cd20bcd5bff57e51fec35736b9a', '954ea64c0e1afaaa85fa5fc7046f642e96000e479721fa7fb37de50ca0bb2a38', '2011-07-07 09:49:07.719939', '2011-07-07 09:49:07.719939', NULL, 'lbnnirmal@gmail.com') RETURNING "id"

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT * FROM "users" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "users"